# Pandas
## DataFrame

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(101)
data = np.random.randint(0, 101, (4, 3))

data

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [3]:
index = ['CA', 'NY', 'AZ', 'TX']
column = ['Feb', 'Dec', 'Mar']

df = pd.DataFrame(data)
df

    0   1   2
0  95  11  81
1  70  63  87
2  75   9  77
3  40   4  63

In [4]:
df = pd.DataFrame(data, index=index)
df

     0   1   2
CA  95  11  81
NY  70  63  87
AZ  75   9  77
TX  40   4  63

In [5]:
df = pd.DataFrame(data, index=index, columns=column)
df

    Feb  Dec  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Feb     4 non-null      int32
 1   Dec     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [9]:
pwd

'c:\\Users\\User\\Desktop\\Burmistrov-s-course\\libraries\\pandas'

In [12]:
ls

 ��� � ���ன�⢥ C �� ����� ��⪨.
 ��਩�� ����� ⮬�: 0C16-2CB4

 ����ন��� ����� c:\Users\User\Desktop\Burmistrov-s-course\libraries\pandas

23.09.2025  09:49    <DIR>          .
23.09.2025  09:49    <DIR>          ..
23.09.2025  09:34                 0 dataframe_part1.ipynb
22.09.2025  10:38           741�554 series_part1.ipynb
22.09.2025  10:38             6�949 series_part2.ipynb
27.01.2020  16:28            18�752 tips.csv
               4 䠩���        767�255 ����
               2 �����  94�465�425�408 ���� ᢮�����

In [13]:
df = pd.read_csv('tips.csv')

df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251